from flask import Flask,render_template

list = [(
        '1',
        'h1.webp',
        'Видалити позначки у книзі',
        'Деякі досі люблять робити позначки у книзі за допомогою маркера. Щоб видалити їх, використовуйте лимонний сік. Нанесіть його на ватний тампон і проведіть за потрібним місцем. Слід маркера зникне.Порада краще працює, якщо маркерна позначка відносно свіжа.'),
    (
        '2',
        'h2.webp',
        'Маркування ключів',
        'Якщо в будинку багато ключів, постійно з’являється плутанина: який для чого. Нанесіть трохи лаку для нігтів на головку ключа, і все стане на місце.'),
    (
        '7',
        'h3.webp',
        'Зберігаємо насіння свіжим',
        'Ніколи не викидайте пакетики кремнезему, які кладуть у магазинах у новий одяг. Кремнезем добре вбирає воду.І коли після весняної посадки у вас залишаться не використані до кінця пакетики з насінням, складіть їх у герметичний короб і додайте до нього пару пакетиків із чарівними безбарвними кристалами.Кремнезем забере всю вологу і не дасть розвинутися плісняві або прорости насіння.'),
    (
        '8',
        'h4.webp',
        'Дзеркала без запотівання',
        'У ванній кімнаті дзеркало постійно в тумані після гарячого душу. Покінчіть із цим раз і назавжди! Нанесіть трохи автомобільного воску на дзеркало, дайте йому висохнути, а потім відполіруйте поверхню сухою м’якою тканиною.')    
        ]
list1 = [(
        '3',
        'ex.jpg',
        'Знайдіть "свій" вид тренувань',
        'Часто людям не подобається не спорт взагалі, а конкретна вправа, наприклад біг або стрибки. Але ж необовязково включати в програму те, що вам не подобається. Практично для будь-якого навантаження можна підібрати альтернативу. Пробуйте різні напрямки та види спорту, тоді ви зможете вибрати саме той, який буде до душі.'),
    (
        '4',
        'coll.jpg',
        'Візьміть з собою друзів',
        'Уявіть, що ви вже домовилися з друзями і йдете бігати всі разом. Не піти буде недобре, адже всі чекають на вас. Цей лайфхак допоможе подружитися з фізичними навантаженнями, адже ви не будете страждати на самоті та завжди зможете отримати моральну підтримку від близьких людей.'),
    (
        '9',
        'er.webp',
        'Починати повільно',
        'Важливо починати регулярні фізичні вправи повільно, щоб не перевантажувати себе. Невеликі, досяжні цілі, такі як 10-хвилинна прогулянка щодня, є хорошим початковим підходом. Починаючи повільно й обережно, ви поступово розвинете витривалість і мотивацію для суворіших тренувань, не докладаючи надмірних зусиль, особливо на початкових етапах.'),
    (
        '10',
        'er1.jpg',
        'Винагороджувати себе',
        'Створення системи винагород за досягнення цілей допоможе з мотивацією. Потішити себе фільмом або новим спорядженням для тренувань в якості винагороди за досягнення певного етапу може зміцнити звичку до регулярних занять спортом. Створення системи винагород додає приємний елемент до процесу й приносить задоволення від досягнення фітнес-цілей.'),
    (
        '11',
        'er2.jpg',
        'Спробувати різні види діяльності',
        'Важливо знайти заняття, які вам дійсно подобаються. Спробувати різні групові заняття з фітнесу, піші прогулянки, плавання, їзду на велосипеді або танці. Отримання задоволення від тренувань може значно полегшити дотримання регулярного режиму тренувань, запобігти нудьзі та зробити їх цікавими.')                    
        ]
list2 = [(
        '5',
        'ka.jpg',
        'Як капусті легше прижитися на городі',
        'Кропива не тільки корисна для здоровя, а й здатна допомогти капусті прижитися на грядці. Якщо встромити стебло кропиви поряд з кожною висадженою рослиною капусти, це може збільшити шанси на успішне приживлення.'),
    (
        '6',
        'k.webp',
        'Збільшення врожайності рослин',
        'Збільшення врожайності рослин залежить від залучення комах-запилювачів. Рожева і біла конюшина, костриця і тонконіг - ефективні рослини, здатні залучити корисних комах. Крім того, квіти гірчиці білої та моркви також можуть стати привабливим місцем для комах.'),
    (
        '12',
        'k1.jpg',
        'Як отримати смачні та соковиті томати',
        'При посадці не менш важливо розташувати коріння розсади глибоко (викопуючи ямки близько 30 см), щоб рослина могла розвиватися у кращому вигляді, отримувати правильне харчування з ґрунту, а також протистояти погоді. Після посадки додайте трохи землі навколо кущиків та зламаних пагонів та листя кропиви, які дадуть томатам необхідну кількість азоту. Нарешті щедро полийте, щоб коріння добре прилипало до землі.'),    
    (
        '13',
        'k2.jpg',
        'Лаванда – природний інсектицид',
        'Ще одна перевага, яку пропонує лаванда, особливо влітку, полягає в тому, що вона є природним засобом від комарів. Насправді, на відміну людей, яких зазвичай приваблює заспокійливий аромат лаванди, цей запах відлякує комарів.'),
    (
        '14',
        'k3.jpg',
        'Удобрюємо троянди в горщиках',
        'Добрива тривалої дії полегшать вам роботу і протягом тривалого часу надають поживні речовини кореневій системі троянд.')        
        
        ]

app = Flask(__name__, template_folder='', static_folder='')


@app.route('/')
def home():
    return render_template('home/index.html',list=list)

@app.route('/<id>')
def item(id):
    for i in list:
        if i[0] == id: 
            return render_template('item.html',item=i)
        
@app.route('/home')
def user():
    return render_template('user/index.html')


@app.route('/training')
def training():
    return render_template('training.html',list1=list1)

@app.route('/life-hacks/<id>')
def item1(id):
    for i in list1:
        if i[0] == id: 
            return render_template('item1.html',item=i)
        
@app.route('/garden')
def garden():
    return render_template('garden.html',list2=list2)

@app.route('/garden/<id>')
def item2(id):
    for i in list2:
        if i[0] == id: 
            return render_template('item2.html',item=i)
        


app.run(debug=True)